# XMLSAXEndDoc

## Description
Write XML using SAX, end of a document. [[VS:XMLSAXBeginDocFile| XMLSAXBeginDocFile]] begins a document.

```pascal
FUNCTION XMLSAXEndDoc(XMLHandle : LONGINT): INTEGER;
```

```python
def vs.XMLSAXEndDoc(XMLHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |

## Examples
[[VS:XMLSAXBeginDocFile]].

## See Also
InitXML | ReleaseXML

XMLSAXBeginDocFile | XMLSAXBeginNode | XMLSAXEndNode | XMLSAXAddNodeAttr | XMLSAXAddNodeValue

## Version
Availability: from Vectorworks 2011

## Category
* XML SAX